const b = "([\\s<\\p{P}]|$)";

const iwords = `(?= 
біс
бсэн
в[аеоы]${b}
верс
вал[гз]
гар
грышч
грэк
дал
дыш
жыц
канапіс
кань?н
ка[цўл]
каў[кц]
ксі
леус
л(іст|${b})
лістас
льк
мант
мась?ц
мбры[кч]
менна 
мідж
мпар[тц]
мпульс[аеуы]
нахадз
нды([ійюя]${b}|ев)
ндэкс(а(ў|мі?)?${b}|[еуыі])
н[еі][ейяю]
нк([аіу])
нтэрым
нфікс
нфімум
нш(а[йя]?|ась?ц|ую|ы(мі|х|я)?)${b}
псілан
р([аыу]|а[мхйў]|амі|)${b}
рад
рбіс
рмас
рха
рыс${b}
скарк
скарак
скра
скравец
скрачк
ста${b}
с[нт]ась?ц
сь?ці[нк]
та(р|${b})
тры
х(ны[хя]?|ную|на[яей])?${b}
ць?він
шыяс)`.replace(/\n/g, "|");

export default [
  [/(?<![\p{L}’])і(?![\p{L}’])/gu, "i"],
  [/(?<![\p{L}’])І(?![\p{L}’])/gu, "I"],
  [/(?<![\p{L}’])і(?=зь?)/gs, "i"],
  [/(?<![\p{L}’])І(?=зь?\s|ЗЬ?\s)/gs, "I"],
  [new RegExp(`(?<![\\p{L}’])і${iwords}`, "gu"), "ji"],
  [new RegExp(`(?<![\\p{L}’])І${iwords}`, "gu"), "Ji"],
  [new RegExp(`(?<![\\p{L}’])І${iwords.toUpperCase()}`, "gu"), "JI"],
  [/(?<=[аеёіоуўыэюяь’АЕЁІОУЎЫЭЮЯЬ >]|^)е/g, "je"],
  [/(?<=[eаеёіоуўыэюяь’АЕЁІОУЎЫЭЮЯЬ >]|^)ё/g, "jo"],
  [/(?<=[eoаеёіоуўыэюяь’АЕЁІОУЎЫЭЮЯЬ >]|^)ю/g, "ju"],
  [/(?<=[eouаеёіоуўыэюяь’АЕЁІОУЎЫЭЮЯЬ >]|^)я/g, "ja"],
  [/(?<=[eouaаеёіоуўыэюяь’АЕЁІОУЎЫЭЮЯЬ]\s*)і/gs, "ji"],
  [/’/g, ""],
  [/ць/g, "ć"],
  [/зь/g, "ź"],
  [/сь/g, "ś"],
  [/нь/g, "ń"],
  [/ль/g, "l"],
  [/а/g, "a"],
  [/б/g, "b"],
  [/в/g, "v"],
  [/г/g, "h"],
  [/ґ/g, "g"],
  [/д/g, "d"],
  [/е/g, "ie"],
  [/ё/g, "io"],
  [/ж/g, "ž"],
  [/з/g, "z"],
  [/і/g, "i"],
  [/й/g, "j"],
  [/к/g, "k"],
  [/л/g, "ł"],
  [/м/g, "m"],
  [/н/g, "n"],
  [/о/g, "o"],
  [/п/g, "p"],
  [/р/g, "r"],
  [/с/g, "s"],
  [/т/g, "t"],
  [/у/g, "u"],
  [/ў/g, "ů"],
  [/ф/g, "f"],
  [/х/g, "ch"],
  [/ц/g, "c"],
  [/ч/g, "č"],
  [/ш/g, "š"],
  [/ы/g, "y"],
  [/э/g, "e"],
  [/ю/g, "iu"],
  [/я/g, "ia"],
  [/[łl]j?i(?=[eoua])/g, "l"],
  [/łj?i/g, "li"],
  [/Е(?=([ \p{P}]*\p{Lu}?\p{Ll}))/gsu, "Je"],
  [/Ё(?=([ \p{P}]*\p{Lu}?\p{Ll}))/gsu, "Jo"],
  [/Ю(?=([ \p{P}]*\p{Lu}?\p{Ll}))/gsu, "Ju"],
  [/Я(?=([ \p{P}]*\p{Lu}?\p{Ll}))/gsu, "Ja"],
  [/(?<=[АЕЁІОУЎЫЭЮЯЬ’ ]\(?)Е/g, "JE"],
  [/(?<=[АЕЁІОУЎЫЭЮЯЬ’ ]\(?)Ё/g, "JO"],
  [/(?<=[АЕЁІОУЎЫЭЮЯЬ’ ]\(?)Ю/g, "JU"],
  [/(?<=[АЕЁІОУЎЫЭЮЯЬ’ ]\(?)Я/g, "JA"],
  [/Е/g, "IE"],
  [/Ё/g, "IO"],
  [/Ю/g, "IU"],
  [/Я/g, "IA"],
  [/Ц[Ьь]/g, "Ć"],
  [/З[Ьь]/g, "Ź"],
  [/С[Ьь]/g, "Ś"],
  [/Н[Ьь]/g, "Ń"],
  [/Л[Ьь]/g, "L"],
  [/А/g, "A"],
  [/Б/g, "B"],
  [/В/g, "V"],
  [/Г/g, "H"],
  [/Ґ/g, "G"],
  [/Д/g, "D"],
  [/Ж/g, "Ž"],
  [/З/g, "Z"],
  [/І/g, "I"],
  [/Й/g, "J"],
  [/К/g, "K"],
  [/Л/g, "Ł"],
  [/М/g, "M"],
  [/Н/g, "N"],
  [/О/g, "O"],
  [/П/g, "P"],
  [/Р/g, "R"],
  [/С/g, "S"],
  [/Т/g, "T"],
  [/У/g, "U"],
  [/Ў/g, "Ů"],
  [/Ф/g, "F"],
  [/Х(?=[\p{Ll}\s])/gsu, "Ch"],
  [/Х/g, "CH"],
  [/Ц/g, "C"],
  [/Ч/g, "Č"],
  [/Ш/g, "Š"],
  [/Ы/g, "Y"],
  [/Э/g, "E"],
  [/[ŁL][Jj]?[Ii](?=[AEOUaeou])/g, "L"],
  [/Łj?i/g, "Li"],
  [/Łj?I/g, "LI"],
];
